<html>
<!-- #BeginTemplate "/Templates/iostemplate.dwt" --> 
<head>
<!-- #BeginEditable "doctitle" --> 
<title>Untitled Document</title>
<!-- #EndEditable --> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../iostext.css" type="text/css">
</head>
<body bgcolor="#00004F" text="#66CCFF" link="#66FFFF" vlink="#66CCFF" alink="#FFFFFF">
<div align="center"> 
  <table width="640" border="0" cellpadding="0" cellspacing="0" class="page" bgcolor="#000066">
    <tr> 
      <td width="640" height="19" valign="top" bgcolor="#00004F"> 
        <div align="center"> 
          
</script>
        </div>
      </td>
    </tr>
    <tr> 
      <td height="11" valign="top" bgcolor="#00004F">&nbsp;</td>
    </tr>
    <tr> 
      <td valign="top" height="102"><img src="../Templates/banner1.gif" width="640" height="102"></td>
    </tr>
    <tr> 
      <td height="17" valign="top"> 
        <table width="100%" border="0" cellpadding="0" cellspacing="0" bgcolor="#000033">
          <tr> 
            <td width="106" height="17" valign="top" align="center"> 
                  <param name="BASE" value=".">
                  <param name=quality value=high>
                  <param name="BGCOLOR" value="#000033">
                  <param name="SCALE" value="exactfit">
                  </embed> 
                </object></p>
            </td>
            <td width="106" valign="top"> 
                  <param name="BASE" value=".">
                  <param name=quality value=high>
                  <param name="BGCOLOR" value="#000033">
                  <param name="SCALE" value="exactfit">
                  </embed> 
                </object></div>
            </td>
            <td width="106" valign="top"> 
                  <param name="BASE" value=".">
                  <param name=quality value=high>
                  <param name="BGCOLOR" value="#000033">
                  <param name="SCALE" value="exactfit">
                  </embed> 
                </object></div>
            </td>
            <td width="107" valign="top" class="iostext"> 
                  <param name="BASE" value=".">
                  <param name=quality value=high>
                  <param name="BGCOLOR" value="#000033">
                  <param name="SCALE" value="exactfit">
                  </embed> 
                </object></font></div>
            </td>
            <td width="107" valign="top"> 
                  <param name="BASE" value=".">
                  <param name=quality value=high>
                  <param name="BGCOLOR" value="#000033">
                  <param name="SCALE" value="exactfit">
                  </embed> 
                </object></font></div>
            </td>
            <td width="107" valign="top"> 
                  <param name=quality value=high>
                  <param name="BGCOLOR" value="#000033">
                  <param name="SCALE" value="exactfit">
                  </embed> 
                </object></div>
            </td>
          </tr>
        </table>
      </td>
    </tr>
    <tr> 
      <td height="7"></td>
    </tr>
    <tr> 
      <td height="4" valign="top"> 
        <table width="100%" border="0" cellpadding="0" cellspacing="0" bgcolor="#00004F">
          <tr> 
            <td width="640" height="1"></td>
          </tr>
        </table>
      </td>
    </tr>
    <tr> 
      <td height="351" valign="top"><!-- #BeginEditable "pge" --> 
        <p>&nbsp;</p>
        <p class="iostext">&nbsp;</p>
        <p class="iostext">HANDBUCH</p>
        <p class="iostext">Hallo Fu&szlig;ballfreunde und willkommen zum International 
          Online Soccer Handbuch.</p>
        <p class="iostext">Inhalt <br>
          1. Was ist IOS?<br>
          2. Installation von IOS<br>
          3. Steuerung<br>
          4. Spielen<br>
          5. Serverbefehle<br>
          6. IOS Team</p>
        <p class="iostext">1. Was ist IOS?</p>
        <p class="iostext">IOS ist der erste kostenlose Fu&szlig;ball - Online 
          - Mehrspieler - MOD f&uuml;r &quot;Half-Life&quot;.<br>
          Das Ziel von IOS ist, im Gegensatz zu den gegenw&auml;rtigen Fu&szlig;ballspielen, 
          eine wahre multiplayer-teamplay Erfahrung zu bieten.<br>
          Wie der Name schon verr&auml;t, werden in IOS nur Nationalmannschaften 
          vertreten sein. Anf&auml;nglich wird es nur ein paar geben, w&auml;hrend 
          das Spiel weiter entwickelt wird, werden noch mehr dazukommen.<br>
          IOS kann in der Ego- oder dritten Personen Perspektive gespielt werden. 
          Die Steuerung ist jedoch f&uuml;r die Ego-Perspektive entwickelt worden.</p>
        <p class="iostext"><br>
          2. Installation von International Online Soccer</p>
        <p class="iostext">IOS zu installieren ist ganz einfach.<br>
          Als erstes musst Du die Verkaufsversion von Half-Life auf Deinem Computer 
          installiert haben (Standardm&auml;&szlig;ig unter C:\Sierra\Half-life). 
          <br>
          Nachdem Du die aktuellste Installations-Version von IOS &uuml;ber http://www.planethalflife.com/ios/ 
          herunter geladen hast, &ouml;ffnest Du die Datei und beginnst mit der 
          Installation. Stelle sicher, dass Du sie in Dein Half-Life-Verzeichnis 
          installierst. Wenn der Installationsprozess abgeschlossen ist, wird 
          ein Icon auf Deinem Desktop erscheinen mit dem Du IOS starten kannst.</p>
        <p class="iostext">3. Steuerung</p>
        <p class="iostext">Bewegungen</p>
        <p class="iostext">Vorw&auml;rts: W<br>
          R&uuml;ckw&auml;rts: S<br>
          Seitlich links: A<br>
          Seitlich rechts: D<br>
          Springen: Leertaste</p>
        <p class="iostext">Schie&szlig;en</p>
        <p class="iostext">Schuss: Durch Dr&uuml;cken der linken Maustaste (Prim&auml;rer 
          Angriff), schie&szlig;t du den Ball in Deine momentane Blickrichtung. 
          <br>
          Durch die Blickrichtung bestimmst du die Zielrichtung und die Kraft 
          des Schusses. <br>
          Zielst Du hoch, wird der Schuss hoch und sehr schnell. <br>
          Zielst Du niedrig, wird der Schuss wenig bis keine Kraft haben, sprich 
          langsam und niedrig. <br>
          Dies ist wiederum sehr n&uuml;tzlich f&uuml;r das Dribbling. <br>
          Wenn Du beim schie&szlig;en die Straf-Taste dr&uuml;ckst schneidest 
          du den Ball an, so dass er eine Kurve fliegt.</p>
        <p class="iostext">Passen</p>
        <p class="iostext">Pass: Durch Dr&uuml;cken der rechten Maustaste (Sekund&auml;rer 
          Angriff), passt du den Ball zum n&auml;chsten Spieler in Deiner Blickrichtung.<br>
          Die st&auml;rke des Passes wird dabei automatisch bestimmt.<br>
          Zielst du hoch, wird der Pass hoch gespielt.<br>
          Zielst du niedrig, wird der Pass flach gespielt.<br>
          Wenn der Passempf&auml;nger sich in Bewegung befindet, wird der Ball 
          etwas vor ihn gespielt. In der Fu&szlig;baller Sprache nennt man so 
          etwas &#132;in den Lauf spielen&#147;.</p>
        <p class="iostext">Sprinten</p>
        <p class="iostext">Sprint: Durch Dr&uuml;cken und halten der Shift-Taste 
          f&auml;ngst du an zu Sprinten. <br>
          Rechts unten am Monitor zeigt Dir ein Sprint-Messger&auml;t an wie<br>
          viel Energie Dir insgesamt f&uuml;r einen Sprint zur Verf&uuml;gung<br>
          stehen w&uuml;rde.<br>
          Wenn Du nach einem Sprint keine Energie mehr hast, gehst Du automatisch 
          in die normale Spielgeschwindigkeit &uuml;ber. <br>
          Die Sprint-Energie wird automatisch nach einer festen Zeit wieder hergestellt.</p>
        <p class="iostext">Takling</p>
        <p class="iostext">Gleittakling: Um einen Gleittakling durchzuf&uuml;hren 
          dr&uuml;ckst Du die<br>
          Strg-Taste. <br>
          Mit diesem Takling ist es m&ouml;glich dem<br>
          Gegenspieler den Ball vom Fu&szlig; oder in einen Schuss zu gr&auml;tschen.<br>
          Bei dieser Attacke wirst du einen Slide ausf&uuml;hren<br>
          und nach kurzer Zeit wieder automatisch aufstehen. <br>
          Wenn die Attacke regelwidrig war, wird ein Faul ausgesprochen und der 
          Gegner bekommt einen Freistoss.<br>
          Vorsicht: Diese Attacke kann auch mit<br>
          einer gelben- oder roten Karte Bestrafft werden.</p>
        <p class="iostext">Stoppen: Um den Ball Geschwindigkeit zu nehmen musst 
          Du ihn nah bei Dir haben und die E-Taste dr&uuml;cken.</p>
        <p class="iostext">Freistoss, Einwurf, Ecken, Elfmeter und Fouls: IOS 
          bestimmt welcher Spieler ihn ausf&uuml;hren darf. Der von IOS nominierte 
          Spieler wird automatisch in die richtige Position gebracht. <br>
          Alle anderen Spieler werden in dieser Zeit von dem ausf&uuml;hrenden 
          Spieler fern gehalten.<br>
          Wenn der Ball innerhalb einer bestimmt Frist von dem ausgew&auml;hlten 
          Spieler nicht gespielt wird, ert&ouml;nt ein Pfiff und der Ball ist 
          wieder frei gegeben. Das Spiel geht normal weiter. </p>
        <p class="iostext"><br>
          Rote und Gelbe Karten: Wenn du nach einem Foul die Rote Karte erh&auml;ltst 
          wirst du f&uuml;r einen<br>
          gewisse Zeit in den Zuschauermodus verbannt.<br>
          Nach dieser Zeitspanne kannst du mit der Enter-Taste wieder dem Spiel 
          beitreten.<br>
          Wenn du schon eine Gelbe Karte erhalten hast und ein zweite bekommen 
          w&uuml;rdest, erh&auml;ltst du automatisch eine Rote Karte.<br>
          Nach jeder Roten Karte verdoppelt sich die Wartezeit, die du erneut 
          in den Zuschauermodus verbannt wirst.</p>
        <p class="iostext">Ego- oder dritt Personen Perspektive: Wenn Du das Mausrad 
          dr&uuml;ckst kannst du jederzeit zwischen den beiden Perspektiven hin 
          und her schalten.</p>
        <p class="iostext">4. Spielen : Du kannst jederzeit einem Public Server 
          beitreten (wenn ein Platz frei ist), oder selber ein Spiel starten.<br>
          Wenn du einem Server beitrittst, musst du dich als erste f&uuml;r ein 
          Team entscheiden indem du gerne Spielen m&ouml;chtest.<br>
          Anschlie&szlig;end suchst Du dir Deine Spielerposition aus, die festlegt 
          wo du auf dem Spielfeld starten wirst.<br>
          Wenn die gew&auml;hlte Position belegt ist, hast du die M&ouml;glichkeit 
          eine andere Position zu w&auml;hlen.</p>
        <p class="iostext">5. Serverbefehle</p>
        <p class="iostext">mp_teamlist: Mit Hilfe dieses Befehls kannst du die 
          Mannschaftsnamen festlegen. Normalerweise w&auml;hlt der Server automatisch 
          zwei Teams, welche von IOS unterst&uuml;tzt werden, aber es ist auch 
          m&ouml;glich diese zu &uuml;berschreiben.<br>
          Wenn das gew&auml;hlt Team von IOS unterst&uuml;tzt wird, werden automatisch 
          die jeweiligen Spielermodelle geladen.</p>
        <p class="iostext">mp_keepers &lt;0-1&gt;: Mit diesem Befehl legst Du 
          fest, ob der automatischen Torwart ein- oder ausgeschaltet wird. <br>
          1 ist ein- 0 ausgeschaltet.<br>
          Standart ist 1.</p>
        <p class="iostext">mp_keeperskill &lt;0-100&gt;: Mit diesem Befehl legst 
          Du die St&auml;rke der Torwarte fest. 100 = ist am besten (aller Kahn), 
          0 = am schlechtesten, <br>
          75 = ist Standart.</p>
        <p class="iostext">mp_redcard &lt;0-999&gt;: Dieser Befehl legt die Zeit 
          in Sekunde fest, die der Spieler in den Zuschauermodus verbannt wird, 
          wenn er eine rote Karte bekommen hat. Die Zeit verdoppelt sich mit jeder 
          weiteren roten Karte. Standart sind 10 Sekunden.</p>
        <p class="iostext">mp_timelimit &lt;Zeit&gt;: Mit diesem Befehl kannst 
          Du die L&auml;nge des Spiels einstellen. Die gew&auml;hlt Zeit wird 
          im Spiel automatisch auf 90 Minuten umgerechnet.<br>
          Wenn das Spiel endet, w&auml;hlt der Server ein neues Stadion und die 
          Spieler k&ouml;nnen neue Teams w&auml;hlen.<br>
          Die Standartzeit ist auf 30 Minuten festgelegt.</p>
        <p class="iostext">mp_roundlimit &lt;Tore&gt;: Mit diesem Befehl kannst 
          du festlegen, nach wie vielen Toren das Spiel automatisch beendet wird. 
          Standart sind 10 Tore f&uuml;r ein Team.</p>
        <p class="iostext"><br>
          mp_autobalance 1: Dieser Befehl stellt die automatische Aufteilung der 
          Teams ein- oder aus. Bei unausgewogenen Teams, werden ein oder mehrere 
          Spieler, automatisch in die Zahlenm&auml;&szlig;ig unterlegene Mannschaft 
          gesetzt.</p>
        <p class="iostext">6. IOS Team</p>
        <p class="iostext">Idee und Konzeption von routetwo<br>
          Spielermodelle von Katharii<br>
          Stadien von Lily<br>
          Linux Programmierung von Rich </p>
        <p></p>
        <p>&nbsp;</p>
        <!-- #EndEditable --></td>
    </tr>
  </table>
</div>
<table width="660" border="0" cellpadding="0" cellspacing="0" mm:layoutgroup="true">
  <tr> 
    <td width="20" height="16"></td>
    <td width="640" valign="top"><!-- #BeginEditable "footer" --><!-- #EndEditable --></td>
  </tr>
</table>
</body>
<!-- #EndTemplate -->
</html>
